app/Controllers/Empleado_controller.php

    public function index()
    {
    $session = session();
    $perfil = $session->get('perfil_id');

    // Solo permitir si es admin o despues quizas otro perfil mas (por ejemplo: [1,3])
    if (!in_array($perfil, [1])) {
        return redirect()->to(base_url('/principal'));
    }

    $model = new empleado_model();
    $data['empleados'] = $model->findAll();
---
SELECT *
FROM `empleados`